{
  "model_type": "llama",
  "architectures": [
    "LlamaForCausalLM"
  ],
  "vocab_size": 32000,
  "hidden_size": 4096,
  "num_hidden_layers": 32,
  "num_attention_heads": 32,
  "num_key_value_heads": 8,
  "intermediate_size": 11008,
  "torch_dtype": "bfloat16",
  "rope_theta": 10000,
  "rope_scaling": {
    "type": "linear",
    "factor": 2
  }
}